# Part One

#### 2. Importing Libraries

In [178]:
import pandas as pd
import numpy as np
import os
import matplotlib.pyplot as plt
import seaborn as sns
import scipy

#### 3. Importing Dataframes

In [179]:
path = r'C:\Users\ProUser11\Desktop\DATA ANALYSIS\Tasks\Module 5\4.1\2020 Instacart Basket Analysis'

In [180]:
#importing customer_data

In [181]:
customer_data = pd.read_csv(os.path.join(path, '02 Data', 'Original Data', 'customers.csv'), index_col = False)

In [182]:
#importing df_ords_prods_merged

In [67]:
df_ords_prods = pd.read_pickle(os.path.join(path, '02 Data', 'Prepared Data', 'orders_products_merged_3.pkl'))

#### 4. Wrangling Data

In [183]:
customer_data.head()

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

##### Renaming Columns

In [185]:
# renaming columns (State)
customer_data = customer_data.rename(columns={'First Name': 'first_name','Surnam': 'surname','Gender': 'gender', 'STATE': 'state', 'Age': 'age', 'date_joined' :'registration_date', 'n_dependants' : 'number_dependants', 'fam_status' : 'marital_status'})

In [186]:
customer_data.head()

,user_id,first_name,surname,gender,state,age,registration_date,number_dependants,marital_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

#### 5. Quality and Consistency Checks

In [187]:
customer_data.describe()

             user_id            age  number_dependants         income
count  206209.000000  206209.000000      206209.000000  206209.000000
mean   103105.000000      49.501646           1.499823   94632.852548
std     59527.555167      18.480962           1.118433   42473.786988
min         1.000000      18.000000           0.000000   25903.000000
25%     51553.000000      33.000000           0.000000   59874.000000
50%    103105.000000      49.000000           1.000000   93547.000000
75%    154657.000000      66.000000           3.000000  124244.000000
max    206209.000000      81.000000           3.000000  593901.000000

In [188]:
customer_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 206209 entries, 0 to 206208
Data columns (total 10 columns):
 #   Column             Non-Null Count   Dtype
---  ------             --------------   -----
 0   user_id            206209 non-null  int64
 1   first_name         194950 non-null  object
 2   surname            206209 non-null  object
 3   gender             206209 non-null  object
 4   state              206209 non-null  object
 5   age                206209 non-null  int64
 6   registration_date  206209 non-null  object
 7   number_dependants  206209 non-null  int64
 8   marital_status     206209 non-null  object
 9   income             206209 non-null  int64
dtypes: int64(4), object(6)
memory usage: 15.7+ MB

In [189]:
customer_data.shape

(206209, 10)

In [190]:
# Finding missing values
customer_data.isnull().sum()

user_id                  0
first_name           11259
surname                  0
gender                   0
state                    0
age                      0
registration_date        0
number_dependants        0
marital_status           0
income                   0
dtype: int64

In [191]:
# there're 11,259 missing values in the First Name column. 
# I will just leave this as is because there is no way to fill out this information.
# I will ask management if they have this info.

##### Checking for duplicates

In [192]:
# checking for the duplicates
customer_data_dups = customer_data.duplicated()

In [193]:
customer_data_dups.info()

<class 'pandas.core.series.Series'>
RangeIndex: 206209 entries, 0 to 206208
Series name: None
Non-Null Count   Dtype
--------------   -----
206209 non-null  bool
dtypes: bool(1)
memory usage: 201.5 KB

In [194]:
customer_data_dups.value_counts()

False    206209
dtype: int64

In [195]:
# No duplicates were found.

#### Finding and converting Mixed type data

In [196]:
# Checking for mixed types
for col in customer_data.columns.tolist():
    weird = (customer_data[[col]].applymap(type) != customer_data[[col]].iloc[0].apply(type)).any(axis = 1)
    if len (customer_data[weird]) > 0:
        print (col)

first_name

In [197]:
# changing column type to string
customer_data['First Name'] = customer_data['First Name'].astype('str')

KeyError: 'First Name'

In [198]:
print(customer_data.dtypes)

user_id               int64
first_name           object
surname              object
gender               object
state                object
age                   int64
registration_date    object
number_dependants     int64
marital_status       object
income                int64
dtype: object

In [199]:
print(df_ords_prods.dtypes)

order_id                     int64
user_id                      int64
order_number                 int64
orders_day_of_week           int64
order_hour_of_day            int64
days_since_prior_order     float64
product_id                   int64
add_to_cart_order            int64
reordered                    int64
product_name                object
aisle_id                     int64
department_id                int64
prices                     float64
_merge                    category
price_range_loc             object
busiest_day                 object
busiest_days                object
busiest_period_of_day       object
max_order                    int64
loyalty_flag                object
avg_price                  float64
spending_flag               object
order_freq                 float64
order_freq_flag             object
dtype: object

In [200]:
df_ords_prods.shape

(32404859, 24)

#### 6. Combining dataframes

In [201]:
#using an outer join to combine dataframes
df_ords_prods_custs = pd.merge(df_ords_prods, customer_data, on = 'user_id', how = 'outer')

#### 7. Exporting Dataframes

In [202]:
# exorting file as a pickle
df_ords_prods_custs.to_pickle(os.path.join(path, '02 Data','Prepared Data', 'df_ords_prods_custs.pkl'))